{
    "Running Shoes": "Give this item to a Doodle so it can flee from any wild Doodle without fail.",
    "Starry Glasses": "Give this item to a Doodle and when it gets sent out, identifies the stars the opponents have.",
    "Used Crayons": "Give this item to a Doodle to have it restore a little bit of its health at the end of every turn. (1/16 HP restoration each turn)",
    "Sniper Scope": "Give this item to a Doodle. The holder, if they haven't taken damage yet this turn, has a boosted critical hit rate. (2x critical hit rate if not attacked before using a move)",
    "Friendship Ribbon": "A doodle [sic] holding this item becomes friendlier faster. (2x friendship gain from all sources)",
    "Riot Shield": "Give this item to a Doodle. When this Doodle uses an attack that makes contact, it protects them from effects caused by attacking the target.",
    "Lighter": "Give this item to a Doodle. At the end of each turn, it inflicts a burn on the user.",
    "Unwashed Plushie": "Give this item to a Doodle. At the end of each turn, it inflicts a disease on the user.",
    "Homemade Plush": "Give this item to a Doodle to improve the damage of its Basic-type attacks. (+20% Basic-type attack damage)",
    "Used Timber": "Give this item to a Doodle to improve the damage of its Fire-type attacks. (+20% Fire-type attack damage)",
    "Pretty Seashell": "Give this item to a Doodle to improve the damage of its Water-type attacks. (+20% Water-type attack damage)",
    "Small Sprout": "Give this item to a Doodle to improve the damage of its Plant-type attacks (+20% Plant-type attack damage)",
    "Battery": "Give this item to a Doodle to improve the damage of its Spark-type attacks. (+20% Spark-type attack damage)",
    "Crooked Talon": "Give this item to a Doodle to improve the damage of its Beast-type attacks. (+20% Beast-type attack damage)",
    "Decorative Fan": "Give this item to a Doodle to improve the damage of its Air-type attacks. (+20% Air-type attack damage)",
    "Delicate Wing": "Give this item to a Doodle to improve the damage of its Insect-type attacks. (+20% Insect-type attack damage)",
    "Lucky Pebble": "Give this item to a Doodle to improve the damage of its Earth-type attacks. (+20% Earth-type attack damage)",
    "Imbued Relic": "Give this item to a Doodle to improve the damage of it's Mind-type attacks. (+20% Mind-type attack damage)",
    "Gauze Wrap": "Give this item to a Doodle to improve the damage of it's Melee-type attacks. (+20% Melee-type attack damage)",
    "Spirit Jar": "Give this item to a Doodle to improve the damage of it's Spirit-type attacks. (+20% Spirit-type attack damage)",
    "Bubblegum": "Give this item to a Doodle to improve the damage of its Food-type attacks (+20% Food-type attack damage)",
    "Refractive Prism": "Give this item to a Doodle to improve the damage of its Light-type attacks. (+20% Light-type attack damage)",
    "Refined Crystal": "Give this item to a Doodle to improve the damage of it's Crystal-type attacks. (+20% Crystal-type attack damage)",
    "Perfect Alloy": "Give this item to a Doodle to improve the damage of its Metal-type attacks. (+20% Metal-type attack damage)",
    "Ice Pack": "Give this item to a Doodle to improve the damage of its Ice-type attacks. (+20% Ice-type attack damage)",
    "Moon Charm": "Give this item to a Doodle to improve the damage of its Dark-type attacks. (+20% Dark-type attack damage)",
    "Questionable Sludge": "Give this item to a Doodle to improve the damage of it's Poison-type attacks. (+20% Poison-type attack damage)",
    "Studded Fang": "Give this item to a Doodle to improve the damage of it's Mythic-type attacks. (+20% Mythic-type attack damage)",
    "Sponge": "Give this item to a Doodle to make it restore 25% more health than normal.",
    "Conductor's Baton": "Give this item to a Doodle to improve its sound-based attacks. (+20% damage to all sound-based attacks)",
    "Dark Chocolate": "Give this item to a Doodle. If they're a Food-type, they gain health at the end of each turn. If not, they take damage at the end of each turn. (1/16 HP restoration/damage)",
    "Sickly Ooze": "Whenever this Doodle would inflict Poison, inflict Diseased instead.",
    "Glasses": "Give this item to a Doodle to improve its accuracy of all its moves by 20%. (1.2x accuracy on all moves)",
    "Grease": "Give this item to a Doodle to prevent it from getting trapped or wrapped, or being chased by Pursuit.",
    "Determination Headband": "Give this item to a Doodle. The doodle may survive attacks that would otherwise cause it to faint. (10% Chance to survive a fatal hit)",
    "Spiky Thorns": "Give this item to a doodle. If the holder is hit by a contact move, the attacker will also be damaged. (Deals 1/6 of the enemy's HP back when hit with a contact move)",
    "Espresso": "Give this item to a doodle. This Doodle has a 25% chance to move first each turn. (25% chance to have increased priority in a turn)",
    "Champion Belt": "Give this item to a Doodle to improve its physical attacks. (+10% damage with all Physical attacks)",
    "Magic Wand": "Give this item to a Doodle to improve its magical attacks. (+10% damage with all Magical attacks)",
    "Cursed Cloak": "Give this item to a Doodle. Disables the use of Support moves, but boosts Magical Defense by 50%.",
    "Lethal Ornament": "Give this item to a Doodle to improve the damage of its attacks by 30%, but at the cost of health on each hit. (+30% damage to all attacks in exchange for 10% HP for each attack used)",
    "Empowered Ring": "Give this item to a Doodle to increase the power of their super effective attacks. (+20% damage to all super-effective attacks)",
    "Frozen TV Dinner": "Give this item to a Doodle. They will be so distracted snacking on a delicious dinner that they will always attack last. (Reduces priority of a Doodle's attacks)",
    "Jetpack": "Give this item to a Doodle so it can dodge one Earth-type attack per battle.",
    "Laminate": "Give this item to a Doodle to preserve it, stopping it from evolving.",
    "Gold Laminate": "Give this item to a Doodle to prevent it from evolving. If the Doodle that is holding it is able to evolve, boost their defense and magical defense by 50%.",
    "Blueprint": "Give this item to a Doodle to make its Shales, Magical Shields, and Crystal Walls last longer. (8 turns instead of 5)",
    "Storm in a Bottle": "Once per battle, when this Doodle gets sent out, summons Rain for 4 turns if there isn't Rain already.",
    "Edible Storm in a Bottle": "Once per battle, when this Doodle gets sent out, summons Chocolate Rain for 4 turns if there isn't Chocolate Rain already.",
    "Acid Storm in a Bottle": "Once per battle, when this Doodle gets sent out, summons Acid Rain for 4 turns if there isn't Acid Rain already.",
    "Sandstorm in a Bottle": "Once per battle, when this Doodle gets sent out, summons Sandstorm for 4 turns if there isn't a sandstorm already.",
    "Stormy Wand": "Give this item to a Doodle to extend the duration of rain used by the holder. (8 turns instead of 5)",
    "Confectioner's Wand": "Give this item to a Doodle to extend the duration of Chocolate Rain used by the holder. (8 turns instead of 5)",
    "Corrosive Wand": "Give this item to a Doodle to extend the duration of Acid Rain used by the holder. (8 turns instead of 5)",
    "Arid Wand": "Give this item to a Doodle to extend the duration of sandstorm used by the holder. (8 turns instead of 5)",
    "Smelly Sock": "If the first Doodle in your party is holding this smelly sock, you are less likely to encounter wild Doodles.",
    "Enchanted Sapphire": "Give this item to a Doodle to boost the holder's magical attack stat but only allows them the use of a single move.",
    "Enchanted Ruby": "Give this item to a Doodle to boost the holder's attack stat but only allows them the use of a single move.",
    "Enchanted Emerald": "Give this item to a Doodle to boost the holder's speed stat but only allows them the use of a single move.",
    "Runestones": "A rune that is different from normal. Give this item to Staligant to have it awaken its true power. (Allows Staligant to undergo Awakening with a different color scheme)",
    "Speed Jelly": "Give this item to a Doodle to have them boost their speed when their health gets low. The item is consumed after use. (Speed is boosted when at 25% or lower HP)",
    "Strength Jelly": "Give this item to a Doodle to increase the power of one of their weak attacks. The item is consumed after use. (Double damage if an attack does less than 25% damage)",
    "Cure Jelly": "Give this item to a Doodle to have it cure a status effect when the Doodle is inflicted with one. This item is consumed after one use.",
    "Magical Jelly": "Give this item to a Doodle to increase the power of one of their magical attacks. The item is consumed after use. (+20% to a single Magical attack)",
    "Defensive Jelly": "Give this item to a Doodle to reduce the power of a super-effective attack. The item is consumed after use. (-15% from an incoming super-effective attack)",
    "Determination Jelly": "Give this item to a Doodle. If they have full HP, the holder will survive an attack that would otherwise cause it to faint. The item is consumed after use.",
    "Heal Jelly": "Give this item to a Doodle to have them heal after their health drops below half. This item is consumed after use. (+25% HP when a Doodle is below 50% HP)",
    "Power Jelly": "Give this item to a Doodle to restore their stats when they are lowered. This item is consumed after use.",
    "Wake-Up Jelly": "Give this item to a Doodle to wake it up when it gets put to sleep. This item is consumed after use.",
    "Weird Jelly": "Give this item to a Doodle to have them boost their attack and magical attack after they are hit with a super-effective attack. The item is consumed after use.",
    "Basic Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Basic-type attack. This item is consumed after use. (+50% damage for a singular Basic-type attack)",
    "Fire Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Fire-type attack. This item is consumed after use. (+50% damage for a singular Fire-type attack)",
    "Water Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Water-type attack. This item is consumed after use. (+50% damage for a singular Water-type attack)",
    "Plant Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Plant-type attack. This item is consumed after use. (+50% damage for a singular Plant-type attack)",
    "Spark Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Spark-type attack. This item is consumed after use. (+50% damage for a singular Spark-type attack)",
    "Beast Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Beast-type attack. This item is consumed after use. (+50% damage for a singular Beast-type attack)",
    "Air Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Air-type attack. This item is consumed after use. (+50% damage for a singular Air-type attack)",
    "Insect Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Insect-type attack. This item is consumed after use. (+50% damage for a singular Insect-type attack)",
    "Earth Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Earth-type attack. This item is consumed after use. (+50% damage for a singular Earth-type attack)",
    "Mind Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Mind-type attack. This item is consumed after use. (+50% damage for a singular Mind-type attack)",
    "Melee Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Melee-type attack. This item is consumed after use. (+50% damage for a singular Melee-type attack)",
    "Food Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Food-type attack. This item is consumed after use. (+50% damage for a singular Food-type attack)",
    "Light Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Light-type attack. This item is consumed after use. (+50% damage for a singular Light-type attack)",
    "Crystal Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Crystal-type attack. This item is consumed after use. (+50% damage for a singular Crystal-type attack)",
    "Metal Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Metal-type attack. This item is consumed after use. (+50% damage for a singular Metal-type attack)",
    "Spirit Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Spirit-type attack. This item is consumed after use. (+50% damage for a singular Spirit-type attack)",
    "Ice Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Ice-type attack. This item is consumed after use. (+50% damage for a singular Ice-type attack)",
    "Dark Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Dark-type attack. This item is consumed after use. (+50% damage for a singular Dark-type attack)",
    "Poison Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Poison-type attack. This item is consumed after use. (+50% damage for a singular Poison-type attack)",
    "Mythic Taffy": "A taffy made in von Sweets' Factory. Give this item to boost the damage of one Mythic-type attack. This item is consumed after use. (+50% damage for a singular Mythic-type attack)",
    "Basic Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Basic-type attack. This item is consumed after use. (-50% damage received from one Basic-type attack)",
    "Fire Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Fire-type attack. This item is consumed after use. (-50% damage received from one Fire-type attack)",
    "Water Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Water-type attack. This item is consumed after use. (-50% damage received from one Water-type attack)",
    "Plant Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Plant-type attack. This item is consumed after use. (-50% damage received from one Plant-type attack)",
    "Spark Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Spark-type attack. This item is consumed after use. (-50% damage received from one Spark-type attack)",
    "Beast Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Beast-type attack. This item is consumed after use. (-50% damage received from one Beast-type attack)",
    "Air Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Air-type attack. This item is consumed after use. (-50% damage received from one Air-type attack)",
    "Insect Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Insect-type attack. This item is consumed after use. (-50% damage received from one Insect-type attack)",
    "Earth Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Earth-type attack. This item is consumed after use. (-50% damage received from one Earth-type attack)",
    "Mind Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Mind-type attack. This item is consumed after use. (-50% damage received from one Mind-type attack)",
    "Melee Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Melee-type attack. This item is consumed after use. (-50% damage received from one Melee-type attack)",
    "Food Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Food-type attack. This item is consumed after use. (-50% damage received from one Food-type attack)",
    "Light Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Light-type attack. This item is consumed after use. (-50% damage received from one Light-type attack)",
    "Crystal Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Crystal-type attack. This item is consumed after use. (-50% damage received from one Crystal-type attack)",
    "Metal Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Metal-type attack. This item is consumed after use. (-50% damage received from one Metal-type attack)",
    "Spirit Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Spirit-type attack. This item is consumed after use. (-50% damage received from one Spirit-type attack)",
    "Ice Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Ice-type attack. This item is consumed after use. (-50% damage received from one Ice-type attack)",
    "Dark Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Dark-type attack. This item is consumed after use. (-50% damage received from one Dark-type attack)",
    "Poison Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Poison-type attack. This item is consumed after use. (-50% damage received from one Poison-type attack)",
    "Mythic Candy Cube": "Some candy made in von Sweets' factory. Give this item to a Doodle to reduce the power of a Mythic-type attack. This item is consumed after use. (-50% damage received from one Mythic-type attack)",
    "Jack in the Box": "Give this item to a Doodle. If the holder is damaged by an attack, the attacker is switched out with a random Doodle. This only works once per battle.",
    "Reflective Shard": "Give this item to a Doodle to have attacks miss 10% more often on it."
  }
  